#============================================================================
## 1.基于配置文件进行可视化
# 静态文件可视化数据分布，该可视化需在数据预处理之后，变量名重映射之前，因为该数据分布仅对原始变量名有效
python main.py --config config.yaml

#============================================================================
# 2.动态数据缺失率计算（独立脚本）
# 运行独立的缺失值分析脚本
python eda_missing.py 

#============================================================================
# 3.动态数据热图分布可视化
# 运行脚本
python /home/phl/PHL/Car-T/dataset_visualizer/heatmap_generator/heatmap_generator_gemini2.py

# 目前最优方案
python /home/phl/PHL/Car-T/dataset_visualizer/heatmap_generator/heatmap_generator_gemini3.py

#============================================================================